app/controllers/comments_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("commenter", "body", "photo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "dilys"], ["body", "test comment"], ["photo_id", 3], ["created_at", "2015-05-31 13:56:44.512909"], ["updated_at", "2015-05-31 13:56:44.512909"]]
---
def create
	@photo =Photo.find(params[:photo_id])
	@comment = @photo.comments.create(comment_params)

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."photo_id" = ? AND "comments"."id" = ? LIMIT 1  [["photo_id", 5], ["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
 def destroy
    @photo = Photo.find(params[:photo_id])
    @comment = @photo.comments.find(params[:id])
    @comment.destroy