app/controllers/photos_controller.rb

INSERT INTO "photos" ("caption", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
		def create
			@photo = Photo.new(photo_params)
			if @photo.save

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "photos" SET "likes" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["likes", 1], ["updated_at", "2015-05-30 11:16:28.602585"], ["id", 1]]
---
def like
    @photo = Photo.find(params[:id])
    @photo.liked!
    @photo.save